{
  "ArithmeticError": "Oops! Something went wrong with your calculations. Double-check your math.",
  "AssertionError": "A check in your code failed. Make sure the conditions you're testing are correct.",
  "AttributeError": "You tried to access something that doesn't exist. Check that the object has the attribute you're looking for.",
  "BufferError": "A buffer issue occurred. Make sure you're handling your data correctly.",
  "EOFError": "We hit the end of the file unexpectedly. Verify that your input is complete.",
  "FloatingPointError": "Something went wrong with floating-point math. Check if you're handling precision or rounding correctly.",
  "GeneratorExit": "A generator finished. This is normal, but make sure your generator is behaving as expected.",
  "ImportError": "Oops! The module or function you're trying to import couldn’t be found. Double-check the name and installation.",
  "ModuleNotFoundError": "The module you're trying to use is missing. Make sure it's installed and available.",
  "IndexError": "You tried to access an index that’s out of range. Check that your index is within the valid range.",
  "KeyError": "That key doesn't exist in the dictionary. Make sure you're using the right key.",
  "KeyboardInterrupt": "You interrupted the program with a keyboard shortcut. Execution has been stopped.",
  "LookupError": "A lookup operation failed. Verify the index or key you're using to access data.",
  "MemoryError": "You ran out of memory! Try reducing the amount of data you're working with or optimizing your memory usage.",
  "NameError": "A variable or function is being used before it’s defined. Make sure everything is initialized properly.",
  "NotImplementedError": "This feature isn't implemented yet. Consider updating your code or finding an alternative.",
  "OSError": "A system-related error occurred. Check if the file or system resource is available and accessible.",
  "BlockingIOError": "The operation would block. Try using non-blocking I/O or adjusting your approach.",
  "ChildProcessError": "There was an issue with a child process. Check the process management and communication setup.",
  "ConnectionError": "A connection issue occurred. Check your network and server connection settings.",
  "BrokenPipeError": "The connection was closed unexpectedly. Make sure the other side of the connection is still active.",
  "ConnectionAbortedError": "The connection was aborted. Check if the remote server is accepting connections.",
  "ConnectionRefusedError": "Connection refused. Make sure the server is up and ready to accept your request.",
  "ConnectionResetError": "The connection was reset. This usually means the remote server lost the connection.",
  "FileExistsError": "The file already exists when it shouldn't. Check your file creation logic.",
  "FileNotFoundError": "The file you're looking for can't be found. Double-check the file path and make sure it exists.",
  "InterruptedError": "The system call was interrupted. This can happen when another process or signal interrupts your operation.",
  "IsADirectoryError": "Expected a file, but found a directory instead. Check the file paths and make sure you're working with the correct type.",
  "NotADirectoryError": "Expected a directory, but found a file instead. Double-check your paths and ensure you're working with directories where needed.",
  "PermissionError": "You don't have permission to access this file or resource. Check your file permissions or try running the program with the right access.",
  "ProcessLookupError": "The process you tried to access doesn’t exist. Check if the process ID is correct and if the process is running.",
  "TimeoutError": "The operation took too long and timed out. You may want to increase the timeout or check the network speed.",
  "RecursionError": "Your code called itself too many times and exceeded the maximum recursion depth. Check your recursion logic for infinite loops.",
  "ReferenceError": "A weak reference was used, but the object it refers to has been deleted. Review how you're managing references.",
  "RuntimeError": "Something unexpected happened during the program's execution. Check for details in the error message.",
  "StopIteration": "You've reached the end of the iterator. This is normal behavior when there are no more items.",
  "StopAsyncIteration": "The asynchronous iterator is finished. This is expected when there’s no more data to fetch.",
  "SyntaxError": "There's a mistake in the structure of your code. Review the syntax and fix any typos or missing symbols.",
  "IndentationError": "Your code’s indentation is off. Make sure you're using consistent spaces or tabs for indentation.",
  "TabError": "You mixed spaces and tabs for indentation. Stick to one style for consistency.",
  "SystemError": "A low-level system error occurred. These are rare, but check the error details for more information.",
  "SystemExit": "The program is exiting. This happens when you call `sys.exit()` or an exit event occurs.",
  "TypeError": "You're trying to use an operation or function on the wrong type of data. Double-check the types of your variables.",
  "UnboundLocalError": "A local variable is being used before it's assigned. Make sure to initialize all variables before using them.",
  "UnicodeError": "Something went wrong with Unicode processing. Ensure you're using the correct character encoding.",
  "UnicodeDecodeError": "There was an issue decoding a Unicode string. Verify the encoding of your data.",
  "UnicodeEncodeError": "There was an issue encoding a Unicode string. Double-check the target encoding you're using.",
  "Warning": "This is a general warning. It's not critical, but you should still check it out.",
  "DeprecationWarning": "This feature is old and will be removed in the future. Consider updating your code to avoid issues later.",
  "SyntaxWarning": "There's a potential problem with your code's syntax. It might not break your program but should be reviewed.",
  "ResourceWarning": "You might not be releasing system resources properly (e.g., files or sockets). Make sure resources are closed after use.",
  "UserWarning": "This is a custom warning raised by your code. Check the details for more information.",
  "FutureWarning": "This feature will change in the future. It's a good idea to update your code now to avoid problems later.",
  "ImportWarning": "There’s an issue with your import statements. Make sure everything you're importing is available and correct.",
  "PendingDeprecationWarning": "This feature will be deprecated soon. Plan to update your code to use newer methods.",
  "RuntimeWarning": "A potential issue occurred during execution. Review the warning details for more context.",
  "BytesWarning": "There’s a problem with how you're handling byte data. Review your byte-related code.",
  "EncodingWarning": "There’s an encoding-related issue. Make sure you're using the correct encoding for your data.",
  "OverflowError": "A numerical operation exceeded the maximum size. Check your calculations to ensure they stay within limits.",
  "ValueError": "You passed a value that’s inappropriate for the operation. Make sure the value fits the expected range or type.",
  "ZeroDivisionError": "You tried to divide by zero. Make sure you're not using zero as a divisor.",
  "NotImplemented": "This feature or method is not available yet. Either find an alternative or implement it yourself.",
  "numpy.linalg.LinAlgError": "A linear algebra operation failed. Double-check your matrix or array operations.",
  "numpy.AxisError": "The axis you're working with is out of range. Verify your array dimensions and axis indexes.",
  "pandas.errors.EmptyDataError": "There’s no data in the file you're trying to load. Ensure the file is not empty and contains valid data.",
  "pandas.errors.DtypeWarning": "The data types in your file don’t match what’s expected. Check the data types and fix them if necessary.",
  "requests.exceptions.RequestException": "Something went wrong with your network request. Check your connection or request parameters.",
  "requests.exceptions.HTTPError": "The server responded with an error. Check the HTTP status code for more details.",
  "requests.exceptions.Timeout": "The request took too long to respond. Try increasing the timeout or check the server status.",
  "matplotlib.errors.AxesError": "There’s an issue with the plotting axes. Make sure your plot is set up correctly.",
  "scikit_learn.exceptions.NotFittedError": "The model hasn’t been trained yet. Ensure you fit the model before using it to make predictions.",
  "scikit_learn.exceptions.ConvergenceWarning": "The model didn’t converge. You may need to adjust your model’s parameters or try a different method.",
  "tensorflow.errors.InvalidArgumentError": "You passed an invalid argument to TensorFlow. Review your input data and shapes.",
  "tensorflow.errors.ResourceExhaustedError": "You’ve run out of resources (like memory). Consider optimizing your model or hardware.",
  "django.db.utils.OperationalError": "Something went wrong with the database. Check your connection, queries, or schema.",
  "flask.exceptions.BadRequest": "The request you made to the Flask server is invalid. Double-check your data or headers.",
  "sqlalchemy.exc.OperationalError": "There was an issue with your SQL query or database connection. Review your database setup.",
  "pydantic.errors.PydanticValueError": "Pydantic validation failed. Check your data for any mismatches with the expected types.",
  "cv2.error": "There was an issue with OpenCV. Check your image data and the operations you're applying.",
  "bs4.FeatureNotFound": "The parser you’re trying to use with BeautifulSoup isn’t available. Try using a different one.",
  "bs4.SoupStrainer": "There’s an error with creating a SoupStrainer. Double-check your usage of BeautifulSoup.",
  "bs4.Tag": "There’s an issue with creating a BeautifulSoup tag. Check your tag creation logic.",
  "json.decoder.JSONDecodeError": "There’s an issue decoding your JSON data. Ensure the format is correct.",
  "xml.etree.ElementTree.ParseError": "An error occurred while parsing your XML data. Verify the structure and syntax.",
  "asyncio.TimeoutError": "An async operation took too long and timed out. Consider increasing the timeout.",
  "asyncio.CancelledError": "The async task was cancelled. Check your task management.",
  "socket.error": "There was a socket issue. Verify your network connections and socket configurations.",
  "subprocess.CalledProcessError": "A subprocess call failed. Check the command and arguments you used.",
  "subprocess.TimeoutExpired": "A subprocess call timed out. Try extending the timeout.",
  "http.client.HTTPException": "An HTTP-related error occurred. Check your request and response details.",
  "http.client.IncompleteRead": "The HTTP response was incomplete. Ensure the server is sending the full data.",
  "http.client.BadStatusLine": "The server sent an invalid response. Check the server's HTTP status line.",
  "xml.parsers.expat.ExpatError": "There’s an issue with parsing XML. Check the structure and syntax of your XML data.",
  "sqlite3.DatabaseError": "There was a problem with your SQLite database. Verify your connection and query.",
  "sqlite3.IntegrityError": "The database’s integrity was violated. Check your data consistency.",
  "xmlrpc.client.Fault": "An XML-RPC error occurred. Review the request and response for more details.",
  "xmlrpc.client.ProtocolError": "There was a protocol error with XML-RPC. Check the request format.",
  "email.errors.MessageError": "There’s a problem with your email message. Check the format and content.",
  "email.errors.HeaderParseError": "There’s an issue with parsing email headers. Review the header structure.",
  "email.errors.BoundaryError": "An issue occurred with email boundaries. Ensure the email format is correct.",
  "multiprocessing.TimeoutError": "A multiprocessing task took too long. Consider increasing the timeout.",
  "multiprocessing.Queue.Empty": "The queue is empty. Ensure data is being added before attempting to read.",
  "multiprocessing.Queue.Full": "The queue is full. Try managing your queue size or clearing it.",
  "multiprocessing.Pool.Error": "There was an issue with the multiprocessing pool. Review your pool configuration.",
  "multiprocessing.ProcessError": "A process-related error occurred. Check your process handling logic."
}
